[{
    "nameSaltekai":
        "Saltekai",
    "ingredientsSaltekai":
        " 4 Eggs\n 1 quart Buttermilk \n 1 pound beets \n 1 Large English cucumber - peeled \n 1/4 cup Minced chives \n 1 bunch Fresh drill \n",
    "stepsSaltekai":[

            " 1. Place the eggs into a saucepan in a single layer and cover the eggs with water by 1 inch. Cover the saucepan and bring the water to a boil. Remove from the heat and let the eggs stand in the hot water for 15 minutes; drain. Cool the eggs under cold running water in the sink. Peel and chop the eggs.\n\n",
            " 2. Pour the buttermilk into a large bowl; add the eggs, beets, cucumber, chives, and dill. Stir gently to combine. Chill in refrigerator for 1 full day before serving."
    ],
    "imageUrlSaltekai": "https://www.lamaistas.lt/uploads/modules/recipes/thumb920x573/29524.jpg",
 
    "nameBorscht":
        "Borscht",
    "ingredientsBorscht":
        " 3 medium beets\n 4 Tbsp olive oil \n 8 cups chicken broth \n 3 medium yukon potatoes - peeled \n 2 carrots, peeled and thinly sliced\n",
    "stepsBorscht":[

            " 1. Peel, grate and/or slice all vegetables (keeping sliced potatoes in cold water to prevent browning until ready to use then drain).\n",
            " 2. Heat a large soup pot (5 1/2 Qt or larger) over medium/high heat and add 2 Tbsp olive oil. Add grated beets and sauté 10 minutes, stirring occasionally until beets are softened. \n",
            " 3. Add 8 cups broth and 2 cups water. Add sliced potatoes and sliced carrots then cook for 10-15 minutes or until easily pierced with a fork. \n",
            " 4. While potatoes are cooking, place a large skillet over medium/high heat and add 2 Tbsp oil. Add chopped onion, celery and bell pepper. Saute stirring occasionally until softened and lightly golden (7-8 minutes). Add 4 Tbsp Ketchup and stir fry 30 seconds then transfer to the soup pot to continue cooking with the potatoes.\n",
            " 5. When potatoes and carrots reach desired softness, add 1 can of beans with their juice, 2 bay leaves, 2-3 Tbsp white vinegar, 1 tsp salt, 1/4 tsp black pepper, 1 pressed garlic clove, and 3 Tbsp chopped dill. Simmer for an additional 2-3 minutes and add more salt and vinegar to taste."
        ],
    "imageUrlBorscht": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Borscht_served.jpg/450px-Borscht_served.jpg",

    "nameCepekai":
        "Cepekai",
    "ingredientsCepekai":[
        " 1 pound ground pork \n",
        " 1 medium onion, peeled and finely chopped\n ",
        "1 1/2 teaspoons kosher salt \n",
        " 1/4 teaspoon freshly ground black pepper\n",
        " 1 large egg, beaten\n",
        " 1 spoon freshly squeezed lemon juice\n",
        " 8 large potatoes, finely grated, 5 pounds\n",
        " 2 large Idaho or Russet potatoes, about 1 1/2 \n pounds, peeled, boiled, and riced\n",
        " 1 medium onion, finely grated\n",
        " 1 1/2 teaspoons kosher salt, more as needed\n",
        " 1 tablespoon cornstarch\n",
        " 1/2 pound bacon, diced\n",
        " 1 large onion, coarsely chopped\n",
        " 1 cup sour cream\n",
        " Freshly ground black pepper, to taste\n",
        " 1 to 2 tablespoons milk, as needed\n"
    ],
    "stepsCepekai":[

       "1. Peel the potatoes, placing the potatoes into a large bowl of cold water as they are peeled to ensure they do not turn brown.",
       "2. Take 500 g | 1 lbs 2 oz of potato, cut into quarters and place in a saucepan. Cover the potatoes with boiling water, place on a high heat and bring back to the boil, then reduce the heat to low, cover with a lid and simmer for 8-12 minutes until the tip of a knife can easily be inserted into the potato pieces. Drain and set aside, uncovered, to cool. \n",
       "3. While the potatoes are boiling grate or purée the remaining raw potato. If you’re not lucky enough to own a specialist potato grating machine, then use either the zesting side of a box grater or purée the potatoes to a very fine pulp in a food processor. If using a food processor you will need to process the potatoes in two batches to ensure there are no small lumps left in the purée.\n",
       "4. Pour the purée into a large piece of butter muslin or cheesecloth (I use a cotton pillowcase) set over a large bowl. Gather the corners of the material and twist to squeeze out all water from the potatoes. This can take 5-10 minutes depending on the variety of potato and the strength of your hands.\n",
       "5. When no further water can be squeezed from the grated potato, carefully transfer the dry grated potato to a large bowl. Keep the liquid that came out of the potatoes – you may need this later\n",
       "6. Using a potato ricer or masher, mash the cooked potatoes until no lumps remain. (Do not add any liquids or fats to the potato as you might if you were making mashed potato.) Add the mashed potato to the grated raw potato.\n",
       "7. Add the salt to the potato and mix well with your hands to fully incorporate the ingredients.\n",
       "8. The resultant dough should be roughly the consistency of play dough – it should form a smooth ball easily but should not stick to your hands. The consistency of the dough is key to the success of your final cepelinai. If it is too wet it will stick to your hands as you form your dumplings. If it is too dry it will crack as you form the dumplings and they may split or fall apart during cooking. If your mix is too dry add a little of the liquid from the grated potatoes, 1 tablespoon at a time, until it reaches the required consistency. If the mixture is too wet, add some potato starch or cornflour, 1 tablespoon at a time, until it reaches the required consistency.\n",
       "9. In a separate bowl, add the pork mince (ground pork), salt, garlic powder and water. Mix thoroughly using your hands.\n",
       "10. Divide both the potato dough and meat mixture into 8 equal portions and lay out on a plate or worktop ready for assembly. Form the meat into tight balls the shape of a rugby ball (American football).\n",
       "11. You are now ready to form your cepelinai. Take a portion of dough and flatten it against the palm of your hand until it is roughly the shape of your hand and just under 1 cm (½ inch) thick, turning regularly as you shape the dough to ensure it does not stick to your hands.\n",
       "12. Place a piece of meat on the centre of the dough, fold the sides of the dough over the top of the meat and pinch the dough together firmly to seal the join. Firmly press the dumpling between your two palms, rotating the dumpling little by little, to form the classic zeppelin shape.\n",
       "13. Ensure there are no cracks on the surface of the dumpling. If you find any cracks, dip your fingertip into the juice from the grated potatoes and gently smooth over the cracks to seal them.\n",
       "14. Continue with the remaining ingredients until you have assembled all your cepelinai.\n",
       "15. Half-fill a 7 litre / 7 quart saucepan, Dutch oven or other large saucepan with cold water and set over a high heat. When the water is boiling, mix 2 tablespoons of potato starch or cornflour with a cup of cold water and add to the saucepan, stirring well as you add the starch liquid to ensure it does not form a gelatinous ball. Adding starch to the cooking water helps to prevent the dumplings from splitting during cooking. It also helps to give the dumplings a smooth, glossy exterior.\n",
       "16. Carefully add the dumplings to the saucepan. (They will initially sink to the bottom, but will later float to the surface.) Cover the saucepan with a lid, bring the water back to the boil, then reduce the heat to very low so that the water is just barely simmering – if the water is boiling too hard the dumplings might split. Simmer for 45 minutes.\n",
       "17. While the cepelinai are cooking make the spirgučiai. Add the bacon pieces to a frying pan or saucepan and set over a high heat. There is no need to add any oil or fat as the fat will render from the bacon. When the bacon pieces are golden and starting to crisp, add the onion and reduce the heat to medium. Cook, stirring frequently, until the onions are soft and just starting to turn brown.\n",
       "18. To serve, carefully lift the cepelinai from the saucepan using a slotted spoon and place on a bowl or plate. Top with a spoon of spirgučiai and a dollop of sour cream.\n"
    ],
    "imageUrlCepekai": "https://static2.inspektorius.lt/usi/755x416/3/98/b3/be/98b3be0ee6d375330882069fe76d34c5.jpg?v=4.2.3.55&t=cr&s=755x416&m=3&f=/Uploads/UArticles/leadPhotos/af/c5/ef/ff/afc5efff78346b5742d4fe0c3ca49580.jpg",

    "nameKugelis":
        "Kugelis",
    "ingredientsKugelis":
        " 1/2 lb bacon \n 6eggs, beaten \n 9 large white potatoes \n 1 small can evaporated milk \n 1 -1/2 tspsalt...pepper to taste. \n 1/2c milk \n 1 grated ,medium onion \n sour cream and or applesauce to serve\n",
    "stepsKugelis":[

            " 1. Cut bacon into small pieces and fry till almost crisp. Grate potatoes into a bowl, drain off all the liquid into a small bowl. \n",
            " 2. Now add the eggs, and mix well, add the evaporated milk, salt and pepper, 1/2 cup milk and the grated onions. Mix well. Pour into a greased flat pan with sides. The height of potatoes in the pan should not be over 1-1/2 inches high. Bake in a pre-heated 350 oven for 1-1/2 hours.\n",
            " 3. Cut into squares to serve. Welike it with sour cream , and or applesauce. It can be cut and fried with ,eggs, and bsacon the next day!. This is a keeper.......... if you like potatoes!"
        ],  
    "imageUrlKugelis": "https://www.beatosvirtuve.lt/wp-content/uploads/2014/11/bvdarzovingaskugelis20141115-988x675.jpg",

    "nameTinginys":
    "Tinginys",
"ingredientsTinginys":
    " 14.1 oz (400 grams) of simple cookies or digestive biscuits\n a can of condensed milk \n 1 1/4 sticks of butter (about 150 g) \n 5 tablespoons of cacao powder  \n Any optional add-ins (here, I used chocolate chunks) \n\n",
"stepsTinginys":[

        " 1. Take all the cookies and crush them by hand into small pieces.\n",
        " 2. Now, melt the butter and add the cacao powder. \n",
        " 3. Add the condensate milk to the butter cacao mixture. Stir it for a couple of minutes, till it creates one smooth mass. \n",
        " 4. Pour the butter-cacao-condensed-milk mixture into the bowl with cookies and combine everything. \n",
        " 5. Add any optional add-ins. In this case, I added 80 grams of nut & raisin chocolate chunks. \n",
        " 6. Now, it’s time to shape it. You can use a cake pan and make it into a traditional cake shape. \n",
        " 7. After resting it in the fridge for at least 2 hours, but ideally overnight, it’s time to serve it. Slice it into pieces and serve it a hot beverage such as tea or coffee.  \n"
],
"imageUrlTinginys": "https://nomadparadise.com/wp-content/uploads/2020/10/190_13.jpg.webp",

"namePancakes":
    "Pancakes",
"ingredientsPancakes":
    " 100g plain flour\n 2 large eggs \n 300ml milk \n 1 tbsp sunflower or vegetable oil, plus a little extra for frying  \n Any optional add-ins (here, I used chocolate chunks) \n\n",
"stepsPancakes":[

        " 1. Put 100g plain flour, 2 large eggs, 300ml milk, 1 tbsp sunflower or vegetable oil and a pinch of salt into a bowl or large jug, then whisk to a smooth batter.\n",
        " 2. Set aside for 30 mins to rest if you have time, or start cooking straight away. \n",
        " 3. Set a medium frying pan or crêpe pan over a medium heat and carefully wipe it with some oiled kitchen paper. \n",
        " 4. When hot, cook your pancakes for 1 min on each side until golden, keeping them warm in a low oven as you go. \n",
        " 5. Serve with lemon wedges and caster sugar, or your favourite filling. Once cold, you can layer the pancakes between baking parchment, then wrap in cling film and freeze for up to 2 months. \n"
        
],
"imageUrlPancakes": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1273477_8-ad36e3b.jpg?resize=960,872?quality=90&webp=true&resize=375,341"
 }
 
 
 ]